app/views/index/home.html.erb

                <option></option>
                <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"

            <tr><td><%= company.name %></td>
            <td><%= Category.find(company.category).name %></td>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "category-two"], ["LIMIT", 1]]