app/views/index/place.html.erb

                            <div class="category-title col-xs-12 col-sm-12 col-lg-12">
                                <span class="number"><%= @no %> <span class="separator">of <a href="/ranking/<%= @company.category %>" title="Top Brunch in SF" style="color:#787878; text-decoration: underline;">Best <%= Category.find(@company.category).name %> in SF</a></span></span>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]