app/views/index/ranking.html.erb

                    <div class="col-md-4 image-container no-padding hidden-sm hidden-xs">
                        <%= link_to image_tag( "images-places-#{index+1}.png", class: 'img-responsive' ), place_path( Category.find(company.category).name, company.name ) %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Example Category"], ["LIMIT", 1]]