app/views/index/search.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fashion Events"], ["LIMIT", 1]]
---
<% category = Category.find(@category).name unless @category.nil? %>