app/views/companies/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="col-sm-10 ">
     <%= f.select :category, options_for_select( Category.all.map {|category| [ category.name, category.id ]} ), :class => 'form-control' %>