app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "category", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ExampleCompany"], ["category", 1], ["city", "Mycity"], ["created_at", 2016-12-16 20:06:52 UTC], ["updated_at", 2016-12-16 20:06:52 UTC]]

  def update
    respond_to do |format|
      if @company.update(company_params)
---
UPDATE "companies" SET "updated_at" = ?, "lat" = ?, "lng" = ?, "photo" = ?, "address" = ? WHERE "companies"."id" = ?