app/controllers/index_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
	def place
		id = params[:id].nil? ? 1 : params[:id]
		@no = params[:no].nil? ? 1 : params[:no]
		@company = Company.find(id)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."category" = ? LIMIT ?  [["category", 1], ["LIMIT", 1]]
---
	def ranking
		category = params[:category].nil? ? 1 : params[:category]
		@category = Category.find(category)
		@companies = Company.where("category = ?", category)

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fashion Events"], ["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE (name LIKE '%%' AND category = 2)
---
	def search
		if params[:search_select].nil? or params[:search_select] == ''
			category = nil
		else
			category = Category.find_by_name(params[:search_select]).id
		end

		if category.nil?
			if params[:search] == '' or params[:search].nil?
				@companies = nil
			else
				@search_str = params[:search]
				@companies = Company.where("name LIKE ?", "%#{params[:search]}%")

INSERT INTO "sub_categories" ("name", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sub Category 1"], ["category_id", 1], ["created_at", 2016-12-08 23:43:49 UTC], ["updated_at", 2016-12-08 23:43:49 UTC]]
INSERT INTO "companies" ("name", "category", "subcategory", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "company1"], ["category", 1], ["subcategory", 2], ["city", "Toront-1"], ["created_at", 2016-12-08 23:43:49 UTC], ["updated_at", 2016-12-08 23:43:49 UTC]]
---
	def creat
		@result = ''
		category_names = ['Brunch Place', 'Fashion Events', 'Hotel', 'Travel Agency', 'Craft Breweire']
		(1..5).each do |int|
			category = Category.new(name: category_names[int-1])
			category.save
			(1..5).each do |sint|
				subcategory = SubCategory.new(name: "#{category_names[int-1]} Sub-#{sint}", category_id: int)
				subcategory.save
			end
			(1..5).each do |cint|
				company = Company.new(name: "Friends of Mine#{int}#{cint}", category: int, subcategory: cint, city: "Richmond-#{cint}", share: int*cint, like: (int+1)*10 )
				company.save