app/controllers/index_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."name" = ? LIMIT ?  [["name", "Example Company"], ["LIMIT", 1]]
---
	def place
		@no = params[:company].nil? ? 1 : Company.find_by_name(params[:company]).id

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "companies"], ["LIMIT", 1]]
---
	def ranking
		category = params[:category].nil? ? 1 : Category.find_by_name(params[:category]).id